### Install libraries and import them

In [7]:
conda install pandas numpy

Channels:
 - defaults
Platform: win-64
Collecting package metadata (repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [8]:
import pandas as pd
import numpy as np

### Confirm where Python and packages are being loaded from

In [6]:
import sys
print(sys.path)

['C:\\Users\\valev\\anaconda3\\envs\\venv_20th_century\\python313.zip', 'C:\\Users\\valev\\anaconda3\\envs\\venv_20th_century\\DLLs', 'C:\\Users\\valev\\anaconda3\\envs\\venv_20th_century\\Lib', 'C:\\Users\\valev\\anaconda3\\envs\\venv_20th_century', '', 'C:\\Users\\valev\\anaconda3\\envs\\venv_20th_century\\Lib\\site-packages', 'C:\\Users\\valev\\anaconda3\\envs\\venv_20th_century\\Lib\\site-packages\\win32', 'C:\\Users\\valev\\anaconda3\\envs\\venv_20th_century\\Lib\\site-packages\\win32\\lib', 'C:\\Users\\valev\\anaconda3\\envs\\venv_20th_century\\Lib\\site-packages\\Pythonwin']

### 5.	Create random data using the pd.DataFrame() function in your new notebook. The test dataframe should contain at least one numeric and one text column.

In [14]:
df = pd.DataFrame({
    'Name': ['Andrea', 'Daniel', 'Natalie', 'Jenny', 'Minho'],
    'Score': [60, 75, 88, 97, 58]
})

In [15]:
df

      Name  Score
0   Andrea     60
1   Daniel     75
2  Natalie     88
3    Jenny     97
4    Minho     58

### 6.	Create a new column and execute a mathematical procedure (e.g., addition, subtraction, multiplication, division) in one of the existing columns using a lambda function

In [23]:
# scores get multiplied by 10% but cap at 100 and rounded to whole numbers
df['with_bonus'] = df['Score'].apply(lambda x: round(min(x * 1.10, 100)))

In [22]:
df

      Name  Score  with_bonus
0   Andrea     60          66
1   Daniel     75          82
2  Natalie     88          97
3    Jenny     97         100
4    Minho     58          64

### 7.	Create a flag column from the text column in your example dataframe using a lambda function (e.g., if you have a country column, you can add a new column region and, using the lambda function, assign its country to its corresponding region). Recap note: A flag column is a type of data column used to indicate a certain condition or status. It’s typically a Boolean column with one of two values: true or false, but it could also be a label like in the “Alice” example

In [24]:
# Create "A" score flag (91 to 100 inclusive)
df['A_score_flag'] = df['with_bonus'].apply(lambda x: 91 <= x <= 100)

In [25]:
df

      Name  Score  with_bonus  A_score_flag
0   Andrea     60          66         False
1   Daniel     75          82         False
2  Natalie     88          97          True
3    Jenny     97         100          True
4    Minho     58          64         False